## Large file reading

Read in a 100MB CSV file with 1.1M rows that can not be read into Excel

In [1]:
import pandas as pd
from pathlib import Path

In [2]:
# This file is too large to fit into github
# You can download it here - https://talk-python-course-videos.nyc3.digitaloceanspaces.com/large-files/2019_customer_transactions.csv
src_file = Path.cwd() / 'data' / 'raw' / '2019_customer_transactions.csv'

In [3]:
# USe timeit to see how long it takes to read the file
#%%timeit
df = pd.read_csv(src_file)

In [4]:
df.head()

,cust_num,sku,category,qty,list_price,discount_rate,invoice_price,invoice_num,invoice_date_time,invoice_total
0,Z00562,PB200,pens,1,3.0,0.27,2.19,7612,2019-08-04 20:41:56.521097,2.19
1,H79033,PB24,pens,5,3.0,0.24,2.28,86854,2019-01-17 03:17:41.873383,11.40
2,U23721,PB24,pens,14,3.0,0.13,2.61,21950,2019-03-03 21:22:11.135135,36.54
3,N80809,PE11,pencils,14,2.0,0.04,1.92,23805,2019-12-19 19:54:38.391874,26.88
4,K89557,PG22,pens,10,3.0,0.06,2.82,35154,2019-02-27 20:19:52.681473,28.20

In [5]:
df.tail()

,cust_num,sku,category,qty,list_price,discount_rate,invoice_price,invoice_num,invoice_date_time,invoice_total
1099995,A89543,PE11,pencils,9,2.0,0.09,1.82,18232,2019-03-14 17:21:06.161259,16.38
1099996,Q25865,PE10,pencils,30,2.0,0.19,1.62,33328,2019-01-02 00:21:27.776807,48.60
1099997,G92394,PB21,pens,3,3.0,0.13,2.61,21923,2019-04-03 20:30:05.297297,7.83
1099998,H70627,PB21,pens,28,3.0,0.12,2.64,29162,2019-10-03 03:05:03.847429,73.92
1099999,I37078,BOOK22,books,35,15.0,0.12,13.20,37822,2019-03-20 02:45:04.133035,462.00

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1100000 entries, 0 to 1099999
Data columns (total 10 columns):
 #   Column             Non-Null Count    Dtype
---  ------             --------------    -----
 0   cust_num           1100000 non-null  object
 1   sku                1100000 non-null  object
 2   category           1100000 non-null  object
 3   qty                1100000 non-null  int64
 4   list_price         1100000 non-null  float64
 5   discount_rate      1100000 non-null  float64
 6   invoice_price      1100000 non-null  float64
 7   invoice_num        1100000 non-null  int64
 8   invoice_date_time  1100000 non-null  object
 9   invoice_total      1100000 non-null  float64
dtypes: float64(4), int64(2), object(4)
memory usage: 83.9+ MB

In [7]:
df.groupby(['category']).agg({'invoice_total': 'sum'}).style.format('${:,.2f}')